{
  "heroImage": { "alt": "KAI USA ltd", "url": "/images/case-study/kai-usa-ltd-banner.png" },
  "intro": "Integrated E-Commerce Experience Leads To 3x Sales For Kai Usa Ltd.",
  "logos": [{ "alt": "KAI USA ltd", "url": "/images/case-study/kai-usa-ltd-logo.png" }],
  "pdfUrl": "/documents/kai-study.pdf",
  "sections": [
    {
      "paragraphs": [
        {
          "text": "Kai USA Ltd. is a leading manufacturer of knives and they’re dedicated to continued innovation, design and manufacturing of top-quality products. Kai USA Ltd. has four product lines (Kershaw Knives brand of sporting and pocketknives; Shun Cutlery brand of handcrafted Japanese kitchen cutlery; Zero Tolerance brand of premium and professional knives; and Kai Housewares brand of kitchen and housewares products) that are sold online and at popular retailers."
        },
        {
          "text": "Kai products are highly regarded for superior quality and excellent value, making them sought after by many. Kai USA Ltd. has been expanding their online reach to engage with customers through digital commerce experiences."
        },
        {
          "isQuote": true,
          "text": "“We run our entire e-commerce business with only one and a half people on the backend. It’s one of the most profitable pieces of our business right now, thanks to e4Integrate’s seamless reliable data flow. It’s changed our business considerably. We’ve been very happy with the professionalism and also the responsiveness of Evenica.” – Matt Matsushima, Director of Operations at Kai USA Ltd."
        }
      ],
      "title": "Evenica’s Client: KAI USA Ltd."
    },
    {
      "paragraphs": [
        {
          "text": "As Kai looked to the future and explored areas where they could expand their business, they saw an opportunity to sell direct to consumers. They recognized that e-commerce was the best way to do that, so they sought out an integration solution that could connect e-commerce and ERP to create a seamless digital commerce channel for their multi-branded business."
        },
        {
          "text": "Kai required an easy to use integration platform knowing that they would have a very small team managing the e-commerce business. They also required a solution that was future proof – one that would seamlessly connect with any business platform that Kai upgraded to in years to come."
        },
        {
          "text": "It was also important to Kai that their e-commerce integration partner have experience with a wide range of platforms, from Magento to Microsoft AX and Dynamics, so that they could rely on their guidance during this pivotal period of growth."
        }
      ],
      "title": "The Challenge"
    },
    {
      "paragraphs": [
        {
          "text": "Evenica came highly recommended by Kai’s technology partner, Blue Horseshoe, for having an experienced team and a robust integration platform that allows for easy integration to Kai’s ERP system. e4Integrate is the ideal solution for Kai because its ease of use and the flexibility it offers in connecting to future platforms as their business grows."
        },
        {
          "text": "What makes e4Integrate such an attractive solution to Kai, are the seamless integrations that allow them to run their entire e-commerce business with only one full-time employee, and one part-time employee. Since working with Evenica, Kai’s e-commerce sales have tripled. Prior to implementing e4Integrate, Kai was doing $400k in sales per year online. They are currently on track to do $3M in the first full year. This speaks volumes to the ease-of-use e4Integrate offers because it allows substantial growth with a small team."
        },
        {
          "isQuote": true,
          "text": "“One of the great things about e4Integrate is that we have been able to do things on our website that we didn’t think were possible. By allowing us to integrate different processes that aren’t built into Magento and be able to integrate it into our ERP system.” – Matt Matsushima, Director of Operations at Kai USA Ltd."
        }
      ],
      "subtitle": "Evenica’s e4Platform",
      "title": "The Solution"
    },
    {
      "paragraphs": [
        {
          "text": "With e4Integrate in place Kai is set-up for a seamless transition during their current ERP upgrade to Microsoft Dynamics. This peace of mind has been invaluable to them. As they continue to grow their commerce business, Kai has an opportunity to further leverage e4Integrate to expand their e-commerce platform to include B2C."
        },
        {
          "text": "As Kai continues to evolve their e-commerce strategy, they also recognize the value in enhancing the customer journey. Evenica looks forward to supporting Kai USA Ltd. as they continue to deliver their world- renowned products to customers."
        },
        {
          "isQuote": true,
          "text": "“Evenica is a great partner. They are very professional, and we appreciate that they always hit their deadlines. There’s a massive amount of experience within the company, which is going to get you to the best result that you could ask for.” – Matt Matsushima, Director of Operations at Kai USA Ltd."
        }
      ],
      "title": "The Evolution"
    }
  ],
  "title": "KAI USA Ltd."
}
