{
  "heroImage": { "alt": "The Raider Image banner", "url": "/images/case-study/the-raider-image-banner.png" },
  "intro": "Kicking Off An Integrated E-Commerce Experience For The Raider Image",
  "logos": [{ "alt": "The Raider Image Logo", "url": "/images/case-study/the-raider-image-logo.png" }],
  "pdfUrl": "/documents/the-raider-image-study.pdf",
  "sections": [
    {
      "paragraphs": [
        {
          "text": "The Las Vegas Raiders are a professional football team based in Las Vegas and competing in the National Football League. With decades of success and a loyal fan base, The Raider Image merchandise is in high demand for game attendees who want to show their support for Raider Nation. The Raider Image works with various suppliers that design and manufacture branded merchandise, as well as strategic partners who have a vested interest in engaging with the Raiders fan base."
        },
        {
          "text": "In 2020, the Raiders moved from Oakland, California to Las Vegas, Nevada – which provided the organization an opportunity to upgrade The Raider Image site to a connected e-commerce solution that is integrated with a modernized backend financial system, Microsoft Dynamics 365 Finance. The site is their official online and in-person storefront where fans can purchase branded merchandise."
        },
        {
          "isQuote": true,
          "text": "“We started this process [of modernizing our e-commerce solution] a few years ago because we were moving from Oakland, California to Las Vegas and as we were embarking on that change, we were examining how we were fulfilling orders and how we were presenting product to people whether it be in-store or online. We selected the omnichannel approach which for us, in the early stages, meant that making sure that stores, stadiums and e-commerce were all integrated and related.” – Barry De Vilbiss, VP of Merchandising at Las Vegas Raiders"
        }
      ],
      "title": "Evenica’s Client: Las Vegas Raiders"
    },
    {
      "paragraphs": [
        {
          "text": "The Raider Image was working with various technology vendors to modernize their backend solutions, and they required a connected commerce solution with seamless integration capabilities. They sought out the expertise of Evenica to implement an e-commerce platform and integration tool that could manage data flow across all of their systems."
        },
        {
          "text": "Their new e-commerce platform needed to have advanced search capabilities, as well as the ability to handle large traffic surges during peak events – such as playoffs, key games and drafts. The Raider Image also required flexibility in the way they presented product – their industry is known to move fast, and they needed their e-commerce platform to be able to adapt as needed."
        },
        {
          "text": "When it came to their integrations, The Raiders Image required a solution that supported an omnichannel approach. They wanted their e-commerce to seamlessly connect to their physical stores and stadiums through fast and reliable data flow."
        }
      ],
      "title": "The Challenge"
    },
    {
      "paragraphs": [
        {
          "text": "Evenica was recommended as an e-commerce partner that could not only provide innovative software, but also progressive thought leadership around the omnichannel approach and fan experience. The decades of experience Evenica brought to the table made them a dependable ally for the Raiders’ exciting new digital strategy."
        },
        {
          "text": "Evenica’s e4Commerce was selected as the Las Vegas Raiders’ e-commerce platform for The Raider Image division because it provided the flexibility they needed for product presentation and rapid evolution. Evenica’s integration platform, e4Integrate, was added to the Raiders’ technology stack in order to achieve the seamless data flow required to establish an omnichannel approach."
        },
        {
          "isQuote": true,
          "text": "“One thing that was really a pleasant surprise is that the other partners that we selected along with Evenica came to us immediately and told us that the integration tool that Evenica has was one of the better tools that they had seen in some of the integrations they had done with other partners, so that gave us a lot of confidence to move forward. From a business standpoint if you wrap all of the omni-channel elements together, we experienced about a 57% increase in business in the first 12 months under this omnichannel approach. We are very confident we’re going to see another 30-40% increase on top of that in a post-pandemic 12 month rolling period.” – Barry De Vilbiss, VP of Merchandising at Las Vegas Raiders"
        }
      ],
      "subtitle": "Evenica’s e4Dynamics & e4Platforms",
      "title": "The Solution"
    },
    {
      "paragraphs": [
        {
          "text": "As Evenica continues to support The Raider Image on their e-commerce evolution, thought leadership around understanding trends for omnichannel solutions is top of mind. The Raiders organization prioritizes their fan experience and Evenica continues to bring fresh ideas on how to connect that experience to e-commerce. Given the dynamic energy within the city of Las Vegas, there’s an exciting momentum of growth and innovation that fans have come to expect."
        },
        {
          "text": "One concept that the Raiders are exploring is the use of virtual reality within the stadium, and the ways in which that experience can connect with e-commerce. It’s this type of forward thinking from the Las Vegas Raiders and Evenica that will allow the brand to continue excelling as a market leader."
        },
        {
          "isQuote": true,
          "text": "“If you want innovation, and you want a professional partner that’s going to challenge you Evenica is a great resource to look at. A partner like Evenica is helping us steer every 6 months, every year, on how to maneuver through what might be possible and what’s the next thing we need to look at to aid in that fan experience” – Barry De Vilbiss, VP of Merchandising at Las Vegas Raiders"
        }
      ],
      "title": "The Evolution"
    }
  ],
  "title": "The Raider Image Case Study"
}
